GetFilterVisibility Method
 Gets the visibility of the elements associated with a filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool GetFilterVisibility(
	ElementId filterElementId
)
Visual Basic
Public Function GetFilterVisibility ( _
	filterElementId As ElementId _
) As Boolean
Visual C++
public:
bool GetFilterVisibility(
	ElementId^ filterElementId
)
Parameters
filterElementId
Type: Autodesk.Revit.DBElementId
 The ElementId of the filter.
Return Value
 True if the elements associated with the filter are visible in the view, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  Filter is not applied to the view. -or- ElementId is not associated with a FilterElement.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
Autodesk.Revit.ExceptionsInvalidOperationException |  The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →